 ![png](BooksEER.png)

##  Link to database

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd
username = "root"
password = "Bl00denemy"
db_name = "Books"
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [2]:
engine = create_engine(connection)

In [3]:
engine

Engine(mysql+pymysql://root:***@localhost/Books)

In [4]:
# create connection to database via the engine
conn = engine.connect()

##  Preview Database

In [5]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

               Tables_in_books
0                       Author
1                        books
2                       client
3                    favorites
4  SELECT @@FOREIGN_KEY_CHECKS
5                        Users
6             Users_has_Author

##  Load the Raw Data File

In [6]:
 client = pd.read_csv('DATA/Customers_books.csv')
client.info()
client.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First Name   7 non-null      object
 1   Last Name    7 non-null      object
 2   Email        7 non-null      object
 3   Book Title   7 non-null      object
 4   Book Author  7 non-null      object
dtypes: object(5)
memory usage: 408.0+ bytes

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [7]:
client.describe()

       First Name Last Name         Email           Book Title   Book Author
count           7         7             7                    7             7
unique          4         3             3                    6             5
top          John       Doe  JD@books.com  Pride and Prejudice  Stephen King
freq            3         3             3                    2             2

In [8]:
client.columns

Index(['First Name', 'Last Name', 'Email', 'Book Title', 'Book Author'], dtype='object')

In [9]:
# Rename columns to match SQL table
rename_map = {"First Name":"First_name",
             "Last Name":"Last_name",
             "Email":"email",
             "Book Author": "Author_name"}
client = client.rename(rename_map,axis=1)
client.head(2)

  First_name Last_name         email   Book Title   Author_name
0       John       Doe  JD@books.com  The Shining  Stephen King
1       John       Doe  JD@books.com           It  Stephen King

In [10]:
client.dtypes

First_name     object
Last_name      object
email          object
Book Title     object
Author_name    object
dtype: object

In [11]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [12]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

,First_name,Last_name,email,Book Title,Author_name
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
5,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
6,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley
7,John,Doe,JD@books.com,The Shining,Stephen King
8,John,Doe,JD@books.com,It,Stephen King
9,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
10,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
11,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
12,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
13,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley
14,John,Doe,JD@books.com,The Shining,Stephen King
15,John,Doe,JD@books.com,It,Stephen King
16,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
17,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
18,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
19,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
20,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley

In [13]:
# Inserting the data now that foreign key checks are disabled
client.to_sql(q, conn,index=False, if_exists='append')

7

In [14]:
# confirm the data has been added
q = """SELECT * FROM client;"""
pd.read_sql(q,conn)

,First_name,Last_name,email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
5,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
6,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley

In [15]:
# check the describe again to confirm no changes
q = """DESCRIBE client;"""
pd.read_sql(q,conn)

         Field  Type Null Key Default Extra
0   First_name  text  YES        None
1    Last_name  text  YES        None
2        email  text  YES        None
3   Book Title  text  YES        None
4  Book Author  text  YES        None

In [16]:
SELECT q.title, favorites.user_id
FROM client
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

SyntaxError: invalid syntax (1856077784.py, line 1)